{
  "products": [
    {
      "id": 1,
      "nombre": "Camiseta Básica",
      "descripcion": "Esta camiseta básica de algodón blanco es un clásico atemporal en cualquier guardarropa. Hecha de 100% algodón, es suave al tacto y cómoda para llevar durante todo el día. Es versátil y se puede combinar fácilmente con cualquier prenda, ya sea un par de jeans para un look casual o una chaqueta elegante para una ocasión más formal. La calidad de la tela garantiza su durabilidad, manteniendo su forma y color lavado tras lavado.",
      "precio": 20,
      "imagen": "https://loremflickr.com/640/480/basictshirt",
      "detalles": "Características:\n- 100% algodón.\n- Disponible en varias tallas.\n- Suave y cómoda.\n- Fácil de combinar.\n- Ideal para cualquier ocasión.",
      "precio_oferta": 18,
      "cantidad": 100,
      "estrellas": 4,
      "categoryId": 1
    },
    {
      "id": 2,
      "nombre": "Jeans Skinny",
      "descripcion": "Estos jeans skinny de mezclilla azul son la opción perfecta para quienes buscan un estilo moderno y ajustado. Confeccionados con una mezcla de algodón y elastano, ofrecen la comodidad necesaria para llevarlos durante todo el día sin sacrificar el estilo. La tela elástica permite que los jeans se adapten a la forma del cuerpo, proporcionando un ajuste favorecedor. Su diseño contemporáneo los convierte en una prenda esencial para cualquier ocasión.",
      "precio": 40,
      "imagen": "https://loremflickr.com/640/480/jeansmen",
      "detalles": "Características:\n- Mezcla de algodón y elastano.\n- Ajuste cómodo y favorecedor.\n- Tela elástica.\n- Diseño moderno.\n- Perfectos para cualquier ocasión.",
      "precio_oferta": 35,
      "cantidad": 60,
      "estrellas": 5,
      "categoryId": 2
    },
    {
      "id": 3,
      "nombre": "Vestido Floral",
      "descripcion": "Este vestido corto con estampado floral es la elección perfecta para los días de primavera y verano. Confeccionado con una tela ligera y fresca, es ideal para mantenerte cómoda en climas cálidos. El diseño floral añade un toque femenino y alegre, haciéndolo perfecto para eventos casuales o una salida especial. Su corte favorecedor se adapta a diferentes tipos de cuerpo, asegurando que te veas y te sientas bien en todo momento.",
      "precio": 50,
      "imagen": "https://loremflickr.com/640/480/dress",
      "detalles": "Características:\n- Tela ligera y fresca.\n- Estampado floral vibrante.\n- Corte favorecedor.\n- Ideal para climas cálidos.\n- Perfecto para eventos casuales.",
      "precio_oferta": 45,
      "cantidad": 80,
      "estrellas": 5,
      "categoryId": 3
    },
    {
      "id": 4,
      "nombre": "Chaqueta de Cuero",
      "descripcion": "Esta chaqueta de cuero negra es un símbolo de estilo y durabilidad. Con un diseño clásico y atemporal, es una prenda que nunca pasa de moda. Hecha de cuero genuino, ofrece una gran resistencia al desgaste y mantiene su aspecto elegante durante años. Es ideal para combinar con diferentes atuendos, ya sea para un look casual o uno más formal. Su ajuste cómodo y su acabado de alta calidad la convierten en una inversión en tu guardarropa.",
      "precio": 150,
      "imagen": "https://loremflickr.com/640/480/leather-jacket",
      "detalles": "Características:\n- Cuero genuino.\n- Diseño clásico y atemporal.\n- Disponible en tallas S, M, L.\n- Resistente al desgaste.\n- Perfecta para cualquier ocasión.",
      "precio_oferta": 135,
      "cantidad": 40,
      "estrellas": 4,
      "categoryId": 4
    },
    {
      "id": 5,
      "nombre": "Sudadera con Capucha",
      "descripcion": "Esta sudadera con capucha es la prenda perfecta para mantenerte abrigado y cómodo durante los días fríos. Hecha de algodón suave, proporciona una sensación agradable en la piel y es ideal para usar en invierno. Su diseño clásico con capucha ajustable y bolsillos frontales la hace práctica y versátil. Es perfecta para combinar con jeans o pantalones deportivos, ofreciendo un look casual y relajado para el día a día.",
      "precio": 35,
      "imagen": "https://loremflickr.com/640/480/hoodie",
      "detalles": "Características:\n- Suave por dentro.\n- Disponible en varios colores.\n- Capucha ajustable.\n- Bolsillos frontales.\n- Ideal para invierno.",
      "precio_oferta": 30,
      "cantidad": 120,
      "estrellas": 4,
      "categoryId": 5
    },
    {
      "id": 6,
      "nombre": "Falda de Cuadros",
      "descripcion": "Esta falda de cuadros estilo escocés es una pieza esencial en cualquier guardarropa. Su diseño clásico y atemporal la hace perfecta para combinar con diferentes prendas, desde blusas elegantes hasta camisetas casuales. Hecha de materiales de alta calidad, es cómoda y resistente, asegurando que se mantenga en perfectas condiciones uso tras uso. Es ideal para crear un look casual y elegante al mismo tiempo, adaptándose a diferentes estilos y ocasiones.",
      "precio": 25,
      "imagen": "https://loremflickr.com/640/480/long-skirt",
      "detalles": "Características:\n- Diseño escocés clásico.\n- Disponible en colores rojo y verde.\n- Materiales de alta calidad.\n- Fácil de combinar.\n- Ideal para cualquier ocasión.",
      "precio_oferta": 20,
      "cantidad": 70,
      "estrellas": 3,
      "categoryId": 6
    },
    {
      "id": 7,
      "nombre": "Pantalones Chinos",
      "descripcion": "Estos pantalones chinos beige son la opción perfecta para un look casual o formal. Con un corte recto y confeccionados en materiales de alta calidad, ofrecen comodidad y estilo en cualquier situación. Su versatilidad permite combinarlos con diferentes tipos de prendas, desde camisetas hasta camisas elegantes, haciendo que se adapten a diferentes ocasiones. Su diseño clásico asegura que se mantengan en tendencia temporada tras temporada.",
      "precio": 45,
      "imagen": "https://loremflickr.com/640/480/chino-pants",
      "detalles": "Características:\n- Corte recto.\n- Perfectos para un look casual o formal.\n- Materiales de alta calidad.\n- Versátiles y cómodos.\n- Mantienen su forma y color.",
      "precio_oferta": 40,
      "cantidad": 85,
      "estrellas": 5,
      "categoryId": 2
    },
    {
      "id": 8,
      "nombre": "Blusa de Encaje",
      "descripcion": "Esta blusa de encaje blanca es la elección perfecta para quienes buscan un toque de elegancia y feminidad. Con detalles de encaje en las mangas, añade un toque delicado y sofisticado a cualquier atuendo. Es ideal para eventos especiales o para darle un toque chic a un look casual. La tela suave y ligera garantiza comodidad durante todo el día, mientras que su diseño versátil permite combinarla con diferentes prendas.",
      "precio": 30,
      "imagen": "https://loremflickr.com/640/480/bloose",
      "detalles": "Características:\n- Detalles de encaje en las mangas.\n- Tela suave y ligera.\n- Ideal para eventos especiales.\n- Versátil y elegante.\n- Fácil de combinar.",
      "precio_oferta": 25,
      "cantidad": 50,
      "estrellas": 4,
      "categoryId": 3
    },
    {
      "id": 9,
      "nombre": "Abrigo Largo",
      "descripcion": "Este abrigo largo gris es la prenda perfecta para mantenerte abrigado durante los meses más fríos del año. Con doble botonadura y un corte elegante, es ideal para quienes buscan un look sofisticado y atemporal. Hecho de materiales de alta calidad, ofrece calidez y durabilidad, asegurando que puedas usarlo temporada tras temporada. Su diseño clásico lo convierte en una prenda versátil, fácil de combinar con diferentes estilos.",
      "precio": 120,
      "imagen": "https://loremflickr.com/640/480/largecoat",
      "detalles": "Características:\n- Doble botonadura.\n- Materiales de alta calidad.\n- Corte elegante.\n- Perfecto para invierno.\n- Versátil y atemporal.",
      "precio_oferta": 110,
      "cantidad": 30,
      "estrellas": 5,
      "categoryId": 4
    },
    {
      "id": 10,
      "nombre": "Camiseta Gráfica",
      "descripcion": "Esta camiseta gráfica es una pieza divertida y expresiva para añadir a tu colección. Con un estampado vibrante, es perfecta para quienes buscan un look casual y moderno. Hecha de algodón suave, ofrece comodidad durante todo el día, mientras que su diseño versátil permite combinarla con diferentes prendas. Es ideal para expresar tu personalidad y estilo único, ya sea que la uses sola o debajo de una chaqueta.",
      "precio": 25,
      "imagen": "https://loremflickr.com/640/480/tshirt",
      "detalles": "Características:\n- Estampado vibrante.\n- Algodón suave y cómodo.\n- Perfecta para un look casual.\n- Fácil de combinar.\n- Ideal para expresar tu estilo.",
      "precio_oferta": 22,
      "cantidad": 95,
      "estrellas": 4,
      "categoryId": 1
    },
    {
      "id": 11,
      "nombre": "Botines de Cuero",
      "descripcion": "Estos botines de cuero negro son la elección perfecta para completar tu look con estilo y elegancia. Confeccionados con cuero genuino, ofrecen una gran durabilidad y resistencia al desgaste. Su diseño clásico con tacón bajo los hace cómodos para llevar durante todo el día, mientras que su estilo versátil permite combinarlos con diferentes atuendos, ya sea para un look casual o más formal. Son una inversión en tu guardarropa, que mantendrán su elegancia temporada tras temporada.",
      "precio": 90,
      "imagen": "https://loremflickr.com/640/480/boots",
      "detalles": "Características:\n- Cuero genuino.\n- Tacón bajo.\n- Diseño clásico y elegante.\n- Duraderos y resistentes.\n- Perfectos para cualquier ocasión.",
      "precio_oferta": 85,
      "cantidad": 50,
      "estrellas": 5,
      "categoryId": 6
    },
    {
      "id": 12,
      "nombre": "Gafas de Sol Retro",
      "descripcion": "Estas gafas de sol retro son un accesorio imprescindible para quienes buscan un look vintage y a la moda. Con un diseño inspirado en los años 60, añaden un toque de estilo a cualquier atuendo. Ofrecen protección UV completa, asegurando que tus ojos estén protegidos de los rayos del sol. Son ligeras y cómodas de llevar durante todo el día, y su diseño unisex las hace perfectas para cualquier persona.",
      "precio": 50,
      "imagen": "https://loremflickr.com/640/480/sunglasses",
      "detalles": "Características:\n- Diseño retro inspirado en los años 60.\n- Protección UV completa.\n- Ligeras y cómodas.\n- Unisex.\n- Perfectas para cualquier ocasión.",
      "precio_oferta": 45,
      "cantidad": 150,
      "estrellas": 4,
      "categoryId": 5
    },
    {
      "id": 13,
      "nombre": "Bolso Tote",
      "descripcion": "Este bolso tote es la combinación perfecta de estilo y funcionalidad. Confeccionado con materiales duraderos, ofrece amplio espacio para llevar todo lo que necesitas a lo largo del día. Su diseño minimalista lo hace ideal para cualquier ocasión, desde una salida casual hasta un día de trabajo. Los detalles en cuero sintético añaden un toque de elegancia, mientras que las asas dobles aseguran comodidad al llevarlo. Es un accesorio versátil y práctico que no puede faltar en tu colección.",
      "precio": 35,
      "imagen": "https://loremflickr.com/640/480/bag",
      "detalles": "Características:\n- Materiales duraderos.\n- Diseño minimalista.\n- Amplio espacio interior.\n- Detalles en cuero sintético.\n- Perfecto para cualquier ocasión.",
      "precio_oferta": 30,
      "cantidad": 120,
      "estrellas": 5,
      "categoryId": 3
    },
    {
      "id": 14,
      "nombre": "Bufanda de Lana",
      "descripcion": "Esta bufanda de lana es el accesorio ideal para mantenerte abrigado durante los días fríos de invierno. Hecha de lana suave, proporciona una sensación cálida y confortable al llevarla. Su diseño clásico la hace fácil de combinar con diferentes atuendos, ya sea un abrigo elegante o una chaqueta casual. Es perfecta para añadir un toque de estilo a tu look invernal, mientras te protege del frío.",
      "precio": 20,
      "imagen": "https://loremflickr.com/640/480/scarf",
      "detalles": "Características:\n- Hecha de lana suave.\n- Diseño clásico.\n- Perfecta para invierno.\n- Cómoda y cálida.\n- Fácil de combinar.",
      "precio_oferta": 18,
      "cantidad": 80,
      "estrellas": 4,
      "categoryId": 4
    },
    {
      "id": 15,
      "nombre": "Sombrero Fedora",
      "descripcion": "Este sombrero fedora es el accesorio perfecto para añadir un toque de estilo y elegancia a cualquier atuendo. Confeccionado con materiales de alta calidad, es ligero y cómodo de llevar durante todo el día. Su diseño clásico lo hace ideal para diferentes ocasiones, ya sea un evento formal o una salida casual. Es el complemento perfecto para quienes buscan un look sofisticado y a la moda.",
      "precio": 25,
      "imagen": "https://loremflickr.com/640/480/hat",
      "detalles": "Características:\n- Materiales de alta calidad.\n- Diseño clásico.\n- Ligero y cómodo.\n- Perfecto para cualquier ocasión.\n- Añade un toque de elegancia.",
      "precio_oferta": 22,
      "cantidad": 50,
      "estrellas": 4,
      "categoryId": 6
    },
    {
      "id": 16,
      "nombre": "Zapatillas Deportivas",
      "descripcion": "Estas zapatillas deportivas son la combinación perfecta de comodidad y rendimiento. Diseñadas para ofrecer un ajuste seguro y soporte durante el ejercicio, son ideales para correr, caminar o cualquier actividad física. Hechas con materiales transpirables y una suela resistente, garantizan durabilidad y confort en cada paso. Su diseño moderno y versátil las hace perfectas para usar tanto en el gimnasio como en el día a día.",
      "precio": 60,
      "imagen": "https://loremflickr.com/640/480/sportshoes",
      "detalles": "Características:\n- Ajuste seguro y cómodo.\n- Materiales transpirables.\n- Suela resistente.\n- Perfectas para cualquier actividad física.\n- Diseño moderno y versátil.",
      "precio_oferta": 55,
      "cantidad": 90,
      "estrellas": 5,
      "categoryId": 5
    },
    {
      "id": 17,
      "nombre": "Reloj de Pulsera",
      "descripcion": "Este reloj de pulsera es el accesorio perfecto para añadir un toque de elegancia a tu look. Con un diseño clásico y una correa de cuero genuino, es ideal para cualquier ocasión. Su esfera minimalista y sus detalles refinados lo convierten en un reloj atemporal que complementa cualquier estilo. Es resistente al agua y duradero, asegurando que puedas llevarlo durante años sin que pierda su encanto. Es el complemento perfecto para cualquier guardarropa.",
      "precio": 100,
      "imagen": "https://loremflickr.com/640/480/watch",
      "detalles": "Características:\n- Diseño clásico y elegante.\n- Correa de cuero genuino.\n- Resistente al agua.\n- Esfera minimalista.\n- Ideal para cualquier ocasión.",
      "precio_oferta": 90,
      "cantidad": 70,
      "estrellas": 5,
      "categoryId": 2
    },
    {
      "id": 18,
      "nombre": "Cinturón de Cuero",
      "descripcion": "Este cinturón de cuero negro es un accesorio esencial para completar cualquier atuendo. Hecho de cuero genuino, ofrece durabilidad y estilo. Su diseño clásico y su hebilla metálica lo hacen perfecto para combinar con pantalones de vestir o jeans. Es ajustable, asegurando un ajuste cómodo y personalizado. Es una inversión en tu guardarropa que mantendrá su elegancia y funcionalidad durante años.",
      "precio": 30,
      "imagen": "https://loremflickr.com/640/480/belt",
      "detalles": "Características:\n- Cuero genuino.\n- Hebilla metálica.\n- Diseño clásico y elegante.\n- Ajustable para un ajuste cómodo.\n- Perfecto para cualquier ocasión.",
      "precio_oferta": 28,
      "cantidad": 120,
      "estrellas": 4,
      "categoryId": 4
    },
    {
      "id": 19,
      "nombre": "Traje de Baño",
      "descripcion": "Este traje de baño es la elección perfecta para los días de verano en la playa o la piscina. Con un diseño moderno y colores vibrantes, es ideal para quienes buscan un look a la moda mientras disfrutan del sol. Hecho de materiales de alta calidad, ofrece comodidad y durabilidad, resistiendo el cloro y el agua salada. Su ajuste cómodo y seguro asegura que puedas disfrutar de tus actividades acuáticas con total confianza.",
      "precio": 40,
      "imagen": "https://loremflickr.com/640/480/swimsuit",
      "detalles": "Características:\n- Diseño moderno y colores vibrantes.\n- Materiales de alta calidad.\n- Resistente al cloro y al agua salada.\n- Ajuste cómodo y seguro.\n- Perfecto para la playa o la piscina.",
      "precio_oferta": 35,
      "cantidad": 150,
      "estrellas": 4,
      "categoryId": 1
    },
    {
      "id": 20,
      "nombre": "Camisa de Lino",
      "descripcion": "Esta camisa de lino es la prenda perfecta para los días calurosos de verano. Hecha de lino ligero y transpirable, ofrece comodidad y frescura durante todo el día. Su diseño elegante y relajado la hace ideal para diferentes ocasiones, desde una salida casual hasta un evento más formal. Es fácil de combinar con diferentes prendas y accesorios, lo que la convierte en una adición versátil a tu guardarropa de verano.",
      "precio": 45,
      "imagen": "https://loremflickr.com/640/480/shirt",
      "detalles": "Características:\n- Lino ligero y transpirable.\n- Diseño elegante y relajado.\n- Perfecta para el verano.\n- Cómoda y fresca.\n- Fácil de combinar.",
      "precio_oferta": 40,
      "cantidad": 85,
      "estrellas": 5,
      "categoryId": 3
    },
    {
      "id": 21,
      "nombre": "Gorra de Béisbol",
      "descripcion": "Esta gorra de béisbol es el accesorio perfecto para quienes buscan un look casual y deportivo. Con un diseño clásico y una visera curvada, es ideal para protegerse del sol mientras disfrutas de tus actividades al aire libre. Hecha de materiales duraderos, asegura comodidad y resistencia. Su estilo versátil la hace perfecta para combinar con diferentes atuendos, ya sea en el gimnasio o en un día de descanso. Es un complemento esencial para cualquier guardarropa casual.",
      "precio": 20,
      "imagen": "https://loremflickr.com/640/480/hat",
      "detalles": "Características:\n- Diseño clásico con visera curvada.\n- Materiales duraderos.\n- Cómoda y resistente.\n- Perfecta para actividades al aire libre.\n- Estilo versátil.",
      "precio_oferta": 18,
      "cantidad": 100,
      "estrellas": 4,
      "categoryId": 6
    },
    {
      "id": 22,
      "nombre": "Chaleco Acolchado",
      "descripcion": "Este chaleco acolchado es la prenda ideal para mantenerte abrigado sin sacrificar el estilo. Con un diseño ligero y acolchado, ofrece calidez sin agregar volumen. Es perfecto para usar sobre una camiseta o debajo de una chaqueta en los días fríos de otoño o invierno. Los bolsillos laterales añaden funcionalidad, mientras que el cierre frontal asegura un ajuste cómodo. Es una opción versátil y práctica para cualquier guardarropa de invierno.",
      "precio": 35,
      "imagen": "https://loremflickr.com/640/480/product",
      "detalles": "Características:\n- Diseño ligero y acolchado.\n- Calidez sin volumen.\n- Bolsillos laterales funcionales.\n- Cierre frontal cómodo.\n- Perfecto para otoño e invierno.",
      "precio_oferta": 30,
      "cantidad": 75,
      "estrellas": 5,
      "categoryId": 4
    },
    {
      "id": 23,
      "nombre": "Pantalones Cargo",
      "descripcion": "Estos pantalones cargo son la elección perfecta para quienes buscan un look casual y funcional. Con múltiples bolsillos, ofrecen amplio espacio para llevar tus pertenencias. Hechos de materiales resistentes, son ideales para actividades al aire libre o para un estilo de vida activo. Su ajuste cómodo y su diseño moderno los hacen perfectos para combinar con diferentes prendas, desde camisetas hasta chaquetas. Son una adición versátil y práctica a tu guardarropa.",
      "precio": 40,
      "imagen": "https://loremflickr.com/640/480/cargopants",
      "detalles": "Características:\n- Múltiples bolsillos funcionales.\n- Materiales resistentes.\n- Ajuste cómodo.\n- Perfectos para actividades al aire libre.\n- Diseño moderno y versátil.",
      "precio_oferta": 35,
      "cantidad": 60,
      "estrellas": 4,
      "categoryId": 3
    },
    {
      "id": 24,
      "nombre": "Zapatillas de Lona",
      "descripcion": "Estas zapatillas de lona son la combinación perfecta de estilo y comodidad. Con un diseño clásico y sencillo, son ideales para el día a día. Hechas de lona resistente y una suela de goma duradera, garantizan comodidad y durabilidad en cada paso. Su estilo versátil las hace fáciles de combinar con diferentes atuendos, ya sea un look casual o algo más deportivo. Son una adición esencial a cualquier guardarropa.",
      "precio": 35,
      "imagen": "https://loremflickr.com/640/480/sportshoes",
      "detalles": "Características:\n- Lona resistente.\n- Suela de goma duradera.\n- Diseño clásico y sencillo.\n- Cómodas y duraderas.\n- Perfectas para el día a día.",
      "precio_oferta": 30,
      "cantidad": 90,
      "estrellas": 5,
      "categoryId": 5
    },
    {
      "id": 25,
      "nombre": "Bufanda de Cachemira",
      "descripcion": "Esta bufanda de cachemira es el accesorio perfecto para añadir un toque de lujo a tu look de invierno. Hecha de cachemira suave y cálida, proporciona una sensación incomparable de confort y elegancia. Su diseño clásico y sofisticado la hace fácil de combinar con diferentes prendas, desde abrigos hasta chaquetas. Es una inversión en tu guardarropa que te mantendrá abrigado y a la moda durante los días fríos. Es el complemento ideal para quienes buscan un estilo refinado y atemporal.",
      "precio": 80,
      "imagen": "https://loremflickr.com/640/480/scarf",
      "detalles": "Características:\n- Hecha de cachemira suave y cálida.\n- Diseño clásico y sofisticado.\n- Perfecta para invierno.\n- Añade un toque de lujo.\n- Fácil de combinar.",
      "precio_oferta": 75,
      "cantidad": 50,
      "estrellas": 5,
      "categoryId": 4
    },
    {
      "id": 26,
      "nombre": "Polo Deportivo",
      "descripcion": "Este polo deportivo es la prenda ideal para quienes buscan un look casual y cómodo durante sus actividades físicas. Hecho de materiales transpirables, asegura frescura y comodidad durante todo el día. Su diseño clásico con cuello y botones lo hace versátil para combinar con diferentes prendas, desde pantalones cortos hasta jeans. Es perfecto para usar en el gimnasio, en una caminata o en cualquier actividad al aire libre.",
      "precio": 30,
      "imagen": "https://loremflickr.com/640/480/t-shirt",
      "detalles": "Características:\n- Materiales transpirables.\n- Diseño clásico con cuello y botones.\n- Cómodo y fresco.\n- Perfecto para actividades físicas.\n- Versátil y fácil de combinar.",
      "precio_oferta": 25,
      "cantidad": 110,
      "estrellas": 4,
      "categoryId": 3
    },
    {
      "id": 27,
      "nombre": "Mochila de Lona",
      "descripcion": "Esta mochila de lona es la compañera perfecta para tus aventuras diarias. Con un diseño espacioso y múltiples compartimentos, ofrece amplio espacio para llevar todo lo que necesitas. Hecha de lona resistente, asegura durabilidad y estilo. Su diseño versátil la hace ideal para el día a día, ya sea que la uses para ir al trabajo, a la universidad o en tus salidas de fin de semana. Es un accesorio práctico y funcional que no puede faltar en tu colección.",
      "precio": 50,
      "imagen": "https://loremflickr.com/640/480/bag",
      "detalles": "Características:\n- Lona resistente.\n- Diseño espacioso con múltiples compartimentos.\n- Cómoda de llevar.\n- Perfecta para el día a día.\n- Estilo versátil y funcional.",
      "precio_oferta": 45,
      "cantidad": 95,
      "estrellas": 5,
      "categoryId": 2
    },
    {
      "id": 28,
      "nombre": "Camisa de Cuadros",
      "descripcion": "Esta camisa de cuadros es la prenda perfecta para un look casual y moderno. Con un diseño clásico de cuadros, es ideal para combinar con jeans o pantalones de vestir. Hecha de algodón suave, ofrece comodidad durante todo el día. Su estilo versátil la hace adecuada para diferentes ocasiones, desde una salida casual hasta un evento más formal. Es una adición esencial a cualquier guardarropa, que te permitirá estar a la moda sin sacrificar la comodidad.",
      "precio": 35,
      "imagen": "https://loremflickr.com/640/480/shirt",
      "detalles": "Características:\n- Diseño clásico de cuadros.\n- Algodón suave y cómodo.\n- Versátil para diferentes ocasiones.\n- Perfecta para un look casual y moderno.\n- Fácil de combinar.",
      "precio_oferta": 30,
      "cantidad": 70,
      "estrellas": 4,
      "categoryId": 3
    },
    {
      "id": 29,
      "nombre": "Sudadera con Capucha",
      "descripcion": "Esta sudadera con capucha es la prenda ideal para quienes buscan comodidad y estilo en su día a día. Con un diseño moderno y una capucha ajustable, es perfecta para los días fríos o para relajarte en casa. Hecha de materiales suaves y cálidos, ofrece una sensación de confort inigualable. Su estilo versátil la hace fácil de combinar con diferentes prendas, desde jeans hasta pantalones deportivos. Es una adición esencial a cualquier guardarropa casual.",
      "precio": 40,
      "imagen": "https://loremflickr.com/640/480/coat",
      "detalles": "Características:\n- Diseño moderno con capucha ajustable.\n- Materiales suaves y cálidos.\n- Cómoda y versátil.\n- Perfecta para días fríos.\n- Fácil de combinar.",
      "precio_oferta": 35,
      "cantidad": 130,
      "estrellas": 5,
      "categoryId": 4
    },
    {
      "id": 30,
      "nombre": "Zapatillas Deportivas",
      "descripcion": "Estas zapatillas deportivas son la elección perfecta para quienes buscan comodidad y rendimiento durante sus actividades físicas. Con un diseño ergonómico y una suela acolchada, garantizan un soporte óptimo para tus pies en cada paso. Hechas de materiales transpirables, aseguran frescura y confort durante todo el día. Su estilo versátil las hace adecuadas tanto para el gimnasio como para un look casual y deportivo. Son una adición esencial a cualquier colección de calzado deportivo.",
      "precio": 60,
      "imagen": "https://loremflickr.com/640/480/shoes",
      "detalles": "Características:\n- Diseño ergonómico con suela acolchada.\n- Materiales transpirables.\n- Soporte óptimo para actividades físicas.\n- Cómodas y frescas.\n- Estilo versátil para diferentes ocasiones.",
      "precio_oferta": 55,
      "cantidad": 65,
      "estrellas": 5,
      "categoryId": 5
    }
  ],
  "categories": [
    {
      "id": 1,
      "nombre": "Camisetas",
      "imagen": "https://images.unsplash.com/photo-1619032561786-ff6c371e0c74?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8M3x8Y2FtaXNldGFzfGVufDB8fDB8fHww"
    },
    {
      "id": 2,
      "nombre": "Pantalones",
      "imagen": "https://images.unsplash.com/photo-1604176354204-9268737828e4?q=80&w=2080&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    },
    {
      "id": 3,
      "nombre": "Vestidos",
      "imagen": "https://images.unsplash.com/photo-1641477206894-cce855c52681?q=80&w=1967&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    },
    {
      "id": 4,
      "nombre": "Abrigos",
      "imagen": "https://images.unsplash.com/photo-1616150326910-6fdb1e30adb7?q=80&w=1974&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    },
    {
      "id": 5,
      "nombre": "Ropa Deportiva",
      "imagen": "https://images.unsplash.com/photo-1605050825345-39bfc6eced70?q=80&w=1974&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    },
    {
      "id": 6,
      "nombre": "Accesorios",
      "imagen": "https://images.unsplash.com/photo-1561828995-aa79a2db86dd?q=80&w=2080&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    }
  ],

  "orders": []
}
